app/controllers/admin/posts_controller.rb

    def create
      @post = Post.new(params[:post])

      respond_to do |format|
        if @post.save
---
INSERT INTO `posts` (`created_at`, `title`, `body`, `updated_at`) VALUES('2009-12-15 22:49:42', 'Ceci est mon premier post', 'Voila le premier post admin', '2009-12-15 22:49:42')

    def update
      @post = Post.find(params[:id])

      respond_to do |format|
        if @post.update_attributes(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `updated_at` = '2009-12-15 22:55:03', `body` = 'Voila le premier post via admin' WHERE `id` = 1