app/controllers/comments_controller.rb

SELECT * FROM `comments` WHERE (`comments`.`id` = 5 AND (`comments`.post_id = 2))
---
  def show
    @comment = @post.comments.find(params[:id])

SELECT * FROM `comments` WHERE (`comments`.`id` = 2)
---
  def edit
    @comment = @post.comments.find(params[:id])

INSERT INTO `comments` (`created_at`, `body`, `updated_at`, `post_id`) VALUES('2009-12-15 22:06:21', 'premier commentaire', '2009-12-15 22:06:21', NULL)
---
  def create
    @comment = @post.comments.build(params[:comment])

    respond_to do |format|
      if @comment.save

SELECT * FROM `comments` WHERE (`comments`.`id` = 2)
UPDATE `comments` SET `updated_at` = '2009-12-15 22:10:56', `body` = '2eme commentaire' WHERE `id` = 2
---
  def update
    @comment = @post.comments.find(params[:id])

    respond_to do |format|
      if @comment.update_attributes(params[:comment])

SELECT * FROM `comments` WHERE (`comments`.`id` = 1 AND (`comments`.post_id = 2))
DELETE FROM `comments` WHERE `id` = 3
---
  def destroy
    @comment = @post.comments.find(params[:id])
    @comment.destroy

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
---
  def load_post
     @post = Post.find(params[:post_id])